In [3]:
import numpy as np
import pandas as pd

df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
data=[['biscuit',20],['cold drink',45],['lays',25],['pizza',249],['burger',89]]
df=pd.DataFrame(data,columns=['Items','Price per unit'])
print(df)

        Items  Price per unit
0     biscuit              20
1  cold drink              45
2        lays              25
3       pizza             249
4      burger              89

In [11]:
data=[['biscuit',20],['cold drink',45],['lays',25],['pizza',249],['burger',89]]
df=pd.DataFrame(data,columns=['Items','Price per unit'])
df

        Items  Price per unit
0     biscuit              20
1  cold drink              45
2        lays              25
3       pizza             249
4      burger              89

In [12]:
data=[['biscuit',20],['cold drink',45],['lays',25],['pizza',249],['burger',89]]
df=pd.DataFrame(data,columns=['Items','Price per unit'],dtype=float)
print(df)

        Items  Price per unit
0     biscuit            20.0
1  cold drink            45.0
2        lays            25.0
3       pizza           249.0
4      burger            89.0

In [13]:
data=[['biscuit',20],['cold drink',45],['lays',25],['pizza',249],['burger',89]]
df=pd.DataFrame(data,columns=['Items','Price per unit'],dtype=float)
df

        Items  Price per unit
0     biscuit            20.0
1  cold drink            45.0
2        lays            25.0
3       pizza           249.0
4      burger            89.0

In [15]:
data={'Name':['vivek','arya','bhavya','vani','vikrant'],'Marks/100':[92,90,95,98,92]}
df=pd.DataFrame(data)
df

      Name  Marks/100
0    vivek         92
1     arya         90
2   bhavya         95
3     vani         98
4  vikrant         92

In [17]:
df.isnull()

    Name  Marks/100
0  False      False
1  False      False
2  False      False
3  False      False
4  False      False

In [18]:
pd.isnull(df)

    Name  Marks/100
0  False      False
1  False      False
2  False      False
3  False      False
4  False      False

In [19]:
df.notnull()

   Name  Marks/100
0  True       True
1  True       True
2  True       True
3  True       True
4  True       True

In [20]:
pd.notnull(df)

   Name  Marks/100
0  True       True
1  True       True
2  True       True
3  True       True
4  True       True

In [21]:
import pandas as pd
import numpy as np
data = {'a' : 0.5, 'b' : 1.9, 'c' : 2.7, 'd' : 4.6}
s = pd.Series(data)
print(s)

a    0.5
b    1.9
c    2.7
d    4.6
dtype: float64

In [23]:
import pandas as pd
import numpy as np
data = {'a' : 0.5, 'b' : 1.9, 'c' : 2.7, 'd' : 4.6}
df = pd.Series(data,index=['b','c','d','a','e'])
df

b    1.9
c    2.7
d    4.6
a    0.5
e    NaN
dtype: float64

In [24]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2],
    'grapes': [0, 6, 8, 12]
}

purchases = pd.DataFrame(data)

purchases

   apples  oranges  grapes
0       3        0       0
1       2        3       6
2       0        7       8
3       1        2      12

In [28]:
purchases = pd.DataFrame(data, index=['James', 'Rohit', 'Lata', 'Dravid'])

purchases

        apples  oranges  grapes
James        3        0       0
Rohit        2        3       6
Lata         0        7       8
Dravid       1        2      12

In [27]:
purchases.loc['June']

apples     3
oranges    0
grapes     0
Name: June, dtype: int64

In [29]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [31]:
s.add_suffix('_item')

0_item    1
1_item    2
2_item    3
3_item    4
dtype: int64

In [35]:
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [3, 4, 5, 6]})
df.add_suffix(' column')

   A column  B column
0         1         3
1         2         4
2         3         5
3         4         6

In [36]:
df = pd.DataFrame({"A": [True, False], "B": [1, 2]})
df

       A  B
0   True  1
1  False  2